Messwerte/Archiv/Raw/apache_benchmark_repeat35/max/default/nginx/target_count_13/repeat_10/6.txt
2020/01/23 05:45:25 Running: ab -c 100 -t 30 -n 1000000 http://192.168.3.100:8006/
2020/01/23 05:45:56 This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/
Benchmarking 192.168.3.100 (be patient)
Finished 54589 requests
Server Software:        nginx/1.17.7
Server Hostname:        192.168.3.100
Server Port:            8006
Document Path:          /
Document Length:        612 bytes
Concurrency Level:      100
Time taken for tests:   30.003 seconds
Complete requests:      54589
Failed requests:        0
Total transferred:      46127705 bytes
HTML transferred:       33408468 bytes
Requests per second:    1819.46 [#/sec] (mean)
Time per request:       54.961 [ms] (mean)
Time per request:       0.550 [ms] (mean, across all concurrent requests)
Transfer rate:          1501.41 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        2   45 195.9      9    4051
Processing:     1    9  50.1      5    2429
Waiting:        0    9  50.0      5    2429
Total:          4   54 205.8     13    4057
Percentage of the requests served within a certain time (ms)
  50%     13
  66%     14
  75%     15
  80%     15
  90%     19
  95%    219
  98%   1028
  99%   1037
 100%   4057 (longest request)
{"connect":{"max":4051,"mean":45,"median":9,"min":2,"stdDev":195.89999389648438},"percentiles":{"100":4057,"50":13,"66":14,"75":15,"80":15,"90":19,"95":219,"98":1028,"99":1037},"processing":{"max":2429,"mean":9,"median":5,"min":1,"stdDev":50.099998474121094},"total":{"max":4057,"mean":54,"median":13,"min":4,"stdDev":205.8000030517578},"waiting":{"max":2429,"mean":9,"median":5,"min":0,"stdDev":50}}
2020/01/23 05:45:56 Matched stat line [Connect:        2   45 195.9      9    4051 Connect 2 45 195.9 9 4051]
2020/01/23 05:45:56 Matched stat line [Processing:     1    9  50.1      5    2429 Processing 1 9 50.1 5 2429]
2020/01/23 05:45:56 Matched stat line [Waiting:        0    9  50.0      5    2429 Waiting 0 9 50.0 5 2429]
2020/01/23 05:45:56 Matched stat line [Total:          4   54 205.8     13    4057 Total 4 54 205.8 13 4057]
2020/01/23 05:45:56 Matched percentline [  50%     13 50 13]
2020/01/23 05:45:56 Matched percentline [  66%     14 66 14]
2020/01/23 05:45:56 Matched percentline [  75%     15 75 15]
2020/01/23 05:45:56 Matched percentline [  80%     15 80 15]
2020/01/23 05:45:56 Matched percentline [  90%     19 90 19]
2020/01/23 05:45:56 Matched percentline [  95%    219 95 219]
2020/01/23 05:45:56 Matched percentline [  98%   1028 98 1028]
2020/01/23 05:45:56 Matched percentline [  99%   1037 99 1037]
2020/01/23 05:45:56 Matched percentline [ 100%   4057 100 4057]